; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 120621 1 3 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	spectrograph0 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
)
(:goal (and
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 0 of 3
3. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 0 of 3
4. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 3
5. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 3
6. (take_image satellite0 star7 instrument1 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 1 of 3
7. (turn_to satellite0 planet9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet9)
   goals met: 1 of 3
8. (take_image satellite0 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 2 of 3
9. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 3
10. (take_image satellite0 phenomenon8 instrument1 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 3 of 3
